#여기에 입력한 코드는 인터프리터(번역) 실행이 안된다.
# 한줄 주석
# 주석이란 ? 코드설명/안내 달기
'''
    여기가 여러줄 주석
    작은 따옴표 ' 3개 열고 닫기
'''

# 실행 이란 : 내가 작성한 코드을 번역해서 컴퓨터에게 명령 전달
    # 1.실행할 파일내에서 오른쪽 클릭 --> 실행
    # 2. ctrl+shift + f10
    # 3. 파이참 상단메뉴 -> 실행 탭 -> 실행 클릭

# 리터럴 : 개발자가 코드파일 직접 입력한 순수 값
    # 'a' , 1 , 3.14 , "daasd"
    # 문자열 리터럴 입력시 ' ' 와 " " 감싼 형식
    # 미리 만들어진 단어 / 기능의 의미 : 키워드 , 문자처리 하면 안된다 .ex) print()

# 출력 함수란 : 출력에 관련된 기능을 제공하는 함수
    # 함수란 : 미리 만들어진 코드들의 집합체
    # 'Hello Python' 이라는 말을 컴퓨터에게 출력하라고 전달
    # 'Hello Python'(리터럴) 010101101010101010110
    # 'Hello Python'(리터럴) print()
    # 함수/기능 사용법 : print( 리터럴 )
print( "Hello Python" )
print( "print" )
print( 3 ) # 정수 리터럴 출력
print( 3.14 ) # 실수 리터럴 출력
print( True ) # 불리언 리터럴 출력
print( False ) # 불리언 리터럴 출력
print( '안녕' ) # 문자열 리터럴 출력
print( "파이썬" ) # 문자열 리터럴 출력
# 코드리뷰 : '파이썬' 이라는 단어를 출력

# 제어/이스케이프 문자
    # \ : 백슬래시( 키보드 엔터 위에 원화기호 키 )
    # \t : 들여쓰기/탭 기능
    # \n : 줄바꿈
    # \" : " 큰따옴표 출력
    # \' : ' 작은따옴표 출력
    # \\ : \ 백슬래시 출력
print("안녕 파이썬")
print("안녕 \t 파이썬")  # 안녕 과 파이썬 사이에 들여쓰기/공백
print("안녕 \n 파이썬")  # 안녕 과 파이썬 사이에 줄바꿈처리
#print("안녕 " 파이썬")  # 오류발생 : "문자열 감싸는 기능
print("안녕 \" 파이썬")
print("안녕 \' 파이썬")
print("안녕 \ 파이썬")







