

############################## 1 #####################################

기본급 = int( input("기본급 입력 : ") ) # input 기본 타입은 문자
수당 = int( input("수당 입력 : "))
실수령액 = 기본급 + 수당 - (기본급*0.1)
print( " 실수령액은 : " , 실수령액 )
############################# 2 ###################################
# 변수 선언
금액 = int( input( "[문제1] 금액 입력 : ") )
# 계산
print("십만원 : " , 금액//100000 , "장" )
# 변수 값 변경 [ 금액에서 십만단위 제외 ]
금액 = 금액 - (금액//100000)*100000
print("만원 : " ,금액//10000 , "장")
금액 = 금액 - (금액//10000)*10000
print("천원 : ",금액//1000 , "장" )
금액 = 금액 - (금액//1000)*1000
print("백원 : " , 금액//100 , "개" )
############################ 3 ###################################
# 배수 와 홀짝

############################ 4 ###################################
# 총점이 몇 이상이면 합격 아니면 불합격

############################ 5 ###################################
# 인천이면서 성인 이면  특별지원금 지급 아니면 지급대상 아닙니다.


